data/Log/Simultaneous/app_perf/setup3/mongom_load.out
java -cp /home/ubuntu/ycsb/mongodb-binding/conf:/home/ubuntu/ycsb/conf:/home/ubuntu/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/ycsb/lib/core-0.12.0.jar:/home/ubuntu/ycsb/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongo-java-driver-3.0.3.jar:/home/ubuntu/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongodb-binding-0.12.0.jar:/home/ubuntu/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/ubuntu/ycsb/mongodb-binding/lib/slf4j-api-1.6.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P /home/ubuntu/ycsb/workloads/workload1 -p mongodb.url=mongodb://10.0.3.144:27017/ycsb?w=0 -p maxexecutiontime=600 -t
YCSB Client 0.12.0
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P /home/ubuntu/ycsb/workloads/workload1 -p mongodb.url=mongodb://10.0.3.144:27017/ycsb?w=0 -p maxexecutiontime=600 -t
Loading workload...
Starting test.
Maximum execution time specified as: 600 secs
2017-06-24 21:38:22:871 0 sec: 0 operations; est completion in 0 seconds 
mongo client connection created with mongodb://10.0.3.144:27017/ycsb?w=0
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2017-06-24 21:38:32:720 10 sec: 470 operations; 47 current ops/sec; est completion in 2 days 11 hours [READ: Count=470, Max=250367, Min=1796, Avg=18175.03, 90=27631, 99=50751, 99.9=250367, 99.99=250367] 
java -cp /home/ubuntu/ycsb/mongodb-binding/conf:/home/ubuntu/ycsb/conf:/home/ubuntu/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/ycsb/lib/core-0.12.0.jar:/home/ubuntu/ycsb/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongo-java-driver-3.0.3.jar:/home/ubuntu/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongodb-binding-0.12.0.jar:/home/ubuntu/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/ubuntu/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/ubuntu/ycsb/mongodb-binding/lib/slf4j-api-1.6.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P /home/ubuntu/ycsb/workloads/workload1 -p mongodb.url=mongodb://10.0.3.144:27017/ycsb?w=0 -p maxexecutiontime=600 -t
YCSB Client 0.12.0
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P /home/ubuntu/ycsb/workloads/workload1 -p mongodb.url=mongodb://10.0.3.144:27017/ycsb?w=0 -p maxexecutiontime=600 -t
Loading workload...
Starting test.
Maximum execution time specified as: 600 secs
2017-06-24 21:43:10:439 0 sec: 0 operations; est completion in 0 seconds 
mongo client connection created with mongodb://10.0.3.144:27017/ycsb?w=0
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2017-06-24 21:43:20:317 10 sec: 497 operations; 49.7 current ops/sec; est completion in 2 days 7 hours [READ: Count=497, Max=393727, Min=3504, Avg=17594.23, 90=27983, 99=39807, 99.9=393727, 99.99=393727] 
2017-06-24 21:43:30:317 20 sec: 1314 operations; 81.7 current ops/sec; est completion in 1 days 18 hours [READ: Count=817, Max=66623, Min=311, Avg=12214.6, 90=23503, 99=32431, 99.9=61855, 99.99=66623] 
2017-06-24 21:43:40:317 30 sec: 2373 operations; 105.9 current ops/sec; est completion in 1 days 11 hours [READ: Count=1059, Max=93183, Min=208, Avg=9424.1, 90=16103, 99=27887, 99.9=55807, 99.99=93183] 
2017-06-24 21:43:50:317 40 sec: 3545 operations; 117.2 current ops/sec; est completion in 1 days 7 hours [READ: Count=1172, Max=87615, Min=208, Avg=8520.91, 90=12647, 99=23343, 99.9=37279, 99.99=87615] 
2017-06-24 21:44:00:317 50 sec: 4687 operations; 114.2 current ops/sec; est completion in 1 days 5 hours [READ: Count=1142, Max=190207, Min=174, Avg=8717.32, 90=12527, 99=35359, 99.9=83263, 99.99=190207] 
2017-06-24 21:44:10:317 60 sec: 5858 operations; 117.1 current ops/sec; est completion in 1 days 4 hours [READ: Count=1171, Max=62207, Min=168, Avg=8485.99, 90=12439, 99=28511, 99.9=57695, 99.99=62207] 
2017-06-24 21:44:20:317 70 sec: 7115 operations; 125.7 current ops/sec; est completion in 1 days 3 hours [READ: Count=1257, Max=61087, Min=166, Avg=7950.1, 90=11823, 99=20159, 99.9=59839, 99.99=61087] 
2017-06-24 21:44:30:317 80 sec: 8389 operations; 127.4 current ops/sec; est completion in 1 days 2 hours [READ: Count=1274, Max=256895, Min=152, Avg=7839.87, 90=11831, 99=20495, 99.9=83135, 99.99=256895] 
2017-06-24 21:44:40:317 90 sec: 9696 operations; 130.7 current ops/sec; est completion in 1 days 1 hours [READ: Count=1307, Max=102783, Min=144, Avg=7648.7, 90=11759, 99=19535, 99.9=62335, 99.99=102783] 
2017-06-24 21:44:50:317 100 sec: 11034 operations; 133.8 current ops/sec; est completion in 1 days 1 hours [READ: Count=1338, Max=47423, Min=145, Avg=7469.99, 90=12007, 99=19967, 99.9=32863, 99.99=47423] 
2017-06-24 21:45:00:317 110 sec: 12344 operations; 131 current ops/sec; est completion in 1 days [READ: Count=1310, Max=42463, Min=151, Avg=7622.48, 90=11775, 99=30959, 99.9=39167, 99.99=42463] 
2017-06-24 21:45:10:317 120 sec: 13628 operations; 128.4 current ops/sec; est completion in 1 days [READ: Count=1284, Max=236159, Min=144, Avg=7786.28, 90=12207, 99=19903, 99.9=39359, 99.99=236159] 
2017-06-24 21:45:20:317 130 sec: 15043 operations; 141.5 current ops/sec; est completion in 23 hours 58 minutes [READ: Count=1415, Max=60511, Min=144, Avg=7057.98, 90=11823, 99=19487, 99.9=48639, 99.99=60511] 
2017-06-24 21:45:30:317 140 sec: 16453 operations; 141 current ops/sec; est completion in 23 hours 35 minutes [READ: Count=1410, Max=60639, Min=141, Avg=7090.47, 90=11935, 99=19567, 99.9=33151, 99.99=60639] 
2017-06-24 21:45:40:317 150 sec: 17830 operations; 137.7 current ops/sec; est completion in 23 hours 19 minutes [READ: Count=1377, Max=120127, Min=139, Avg=7254.84, 90=12319, 99=20143, 99.9=76351, 99.99=120127] 
2017-06-24 21:45:50:317 160 sec: 19227 operations; 139.7 current ops/sec; est completion in 23 hours 4 minutes [READ: Count=1397, Max=137727, Min=139, Avg=7156.22, 90=12319, 99=19775, 99.9=78975, 99.99=137727] 
2017-06-24 21:46:00:317 170 sec: 20766 operations; 153.9 current ops/sec; est completion in 22 hours 41 minutes [READ: Count=1539, Max=58143, Min=140, Avg=6496.82, 90=11543, 99=19551, 99.9=43327, 99.99=58143] 
2017-06-24 21:46:10:317 180 sec: 22266 operations; 150 current ops/sec; est completion in 22 hours 24 minutes [READ: Count=1500, Max=75199, Min=143, Avg=6656.54, 90=11967, 99=19679, 99.9=38175, 99.99=75199] 
2017-06-24 21:46:20:317 190 sec: 23817 operations; 155.1 current ops/sec; est completion in 22 hours 6 minutes [READ: Count=1551, Max=197119, Min=140, Avg=6447.98, 90=11871, 99=18895, 99.9=20447, 99.99=197119] 
2017-06-24 21:46:30:317 200 sec: 25413 operations; 159.6 current ops/sec; est completion in 21 hours 48 minutes [READ: Count=1596, Max=75071, Min=139, Avg=6261.98, 90=11599, 99=19663, 99.9=44191, 99.99=75071] 
2017-06-24 21:46:40:317 210 sec: 26978 operations; 156.5 current ops/sec; est completion in 21 hours 33 minutes [READ: Count=1565, Max=169471, Min=142, Avg=6385.52, 90=11511, 99=19343, 99.9=47231, 99.99=169471] 
2017-06-24 21:46:50:317 220 sec: 28544 operations; 156.6 current ops/sec; est completion in 21 hours 20 minutes [READ: Count=1566, Max=62495, Min=141, Avg=6376.15, 90=12263, 99=20175, 99.9=29135, 99.99=62495] 
2017-06-24 21:47:00:317 230 sec: 30214 operations; 167 current ops/sec; est completion in 21 hours 4 minutes [READ: Count=1670, Max=63263, Min=141, Avg=5985.36, 90=11591, 99=19487, 99.9=37343, 99.99=63263] 
2017-06-24 21:47:10:317 240 sec: 31896 operations; 168.2 current ops/sec; est completion in 20 hours 50 minutes [READ: Count=1682, Max=51807, Min=140, Avg=5940.95, 90=11943, 99=20095, 99.9=39007, 99.99=51807] 
2017-06-24 21:47:20:317 250 sec: 33622 operations; 172.6 current ops/sec; est completion in 20 hours 35 minutes [READ: Count=1726, Max=101631, Min=139, Avg=5790.29, 90=11783, 99=20159, 99.9=39871, 99.99=101631] 
2017-06-24 21:47:30:317 260 sec: 35354 operations; 173.2 current ops/sec; est completion in 20 hours 21 minutes [READ: Count=1732, Max=77055, Min=139, Avg=5760.33, 90=11615, 99=19663, 99.9=56607, 99.99=77055] 
2017-06-24 21:47:40:317 270 sec: 37120 operations; 176.6 current ops/sec; est completion in 20 hours 7 minutes [READ: Count=1766, Max=42527, Min=140, Avg=5664.36, 90=11895, 99=20015, 99.9=33215, 99.99=42527] 
2017-06-24 21:47:50:317 280 sec: 38884 operations; 176.4 current ops/sec; est completion in 19 hours 55 minutes [READ: Count=1764, Max=161151, Min=138, Avg=5665.46, 90=11783, 99=19775, 99.9=44543, 99.99=161151] 
2017-06-24 21:48:00:317 290 sec: 40739 operations; 185.5 current ops/sec; est completion in 19 hours 41 minutes [READ: Count=1855, Max=66559, Min=137, Avg=5384.69, 90=11775, 99=19807, 99.9=35999, 99.99=66559] 
2017-06-24 21:48:10:317 300 sec: 42700 operations; 196.1 current ops/sec; est completion in 19 hours 25 minutes [READ: Count=1961, Max=40383, Min=139, Avg=5095.93, 90=11567, 99=19983, 99.9=38047, 99.99=40383] 
2017-06-24 21:48:20:317 310 sec: 44691 operations; 199.1 current ops/sec; est completion in 19 hours 10 minutes [READ: Count=1991, Max=43327, Min=137, Avg=5019.44, 90=11447, 99=20031, 99.9=32367, 99.99=43327] 
2017-06-24 21:48:30:317 320 sec: 46655 operations; 196.4 current ops/sec; est completion in 18 hours 57 minutes [READ: Count=1964, Max=116095, Min=138, Avg=5086.11, 90=11335, 99=19647, 99.9=70207, 99.99=116095] 
2017-06-24 21:48:40:317 330 sec: 48747 operations; 209.2 current ops/sec; est completion in 18 hours 42 minutes [READ: Count=2092, Max=52255, Min=136, Avg=4779.24, 90=11303, 99=19631, 99.9=43167, 99.99=52255] 
2017-06-24 21:48:50:317 340 sec: 50875 operations; 212.8 current ops/sec; est completion in 18 hours 28 minutes [READ: Count=2128, Max=77887, Min=140, Avg=4693.27, 90=11343, 99=19311, 99.9=40447, 99.99=77887] 
2017-06-24 21:49:00:317 350 sec: 53033 operations; 215.8 current ops/sec; est completion in 18 hours 14 minutes [READ: Count=2158, Max=39967, Min=136, Avg=4629.31, 90=11127, 99=19839, 99.9=38719, 99.99=39967] 
2017-06-24 21:49:10:317 360 sec: 55268 operations; 223.5 current ops/sec; est completion in 17 hours 59 minutes [READ: Count=2235, Max=191103, Min=136, Avg=4471.73, 90=11007, 99=19711, 99.9=36735, 99.99=191103] 
2017-06-24 21:49:20:317 370 sec: 57632 operations; 236.4 current ops/sec; est completion in 17 hours 43 minutes [READ: Count=2364, Max=51871, Min=135, Avg=4226.16, 90=10935, 99=19263, 99.9=32895, 99.99=51871] 
2017-06-24 21:49:30:317 380 sec: 59828 operations; 219.6 current ops/sec; est completion in 17 hours 32 minutes [READ: Count=2196, Max=70335, Min=138, Avg=4546.66, 90=11319, 99=20191, 99.9=55103, 99.99=70335] 
2017-06-24 21:49:40:317 390 sec: 62202 operations; 237.4 current ops/sec; est completion in 17 hours 18 minutes [READ: Count=2374, Max=63359, Min=136, Avg=4203.09, 90=11143, 99=19599, 99.9=29263, 99.99=63359] 
2017-06-24 21:49:50:317 400 sec: 64606 operations; 240.4 current ops/sec; est completion in 17 hours 5 minutes [READ: Count=2404, Max=190591, Min=136, Avg=4161.07, 90=11183, 99=19871, 99.9=45407, 99.99=190591] 
2017-06-24 21:50:00:317 410 sec: 67251 operations; 264.5 current ops/sec; est completion in 16 hours 49 minutes [READ: Count=2645, Max=101887, Min=135, Avg=3777.24, 90=10919, 99=19775, 99.9=37631, 99.99=101887] 
2017-06-24 21:50:10:317 420 sec: 69854 operations; 260.3 current ops/sec; est completion in 16 hours 35 minutes [READ: Count=2603, Max=37631, Min=136, Avg=3834.24, 90=10871, 99=19727, 99.9=28063, 99.99=37631] 
2017-06-24 21:50:20:317 430 sec: 72566 operations; 271.2 current ops/sec; est completion in 16 hours 20 minutes [READ: Count=2712, Max=106431, Min=136, Avg=3690.54, 90=10983, 99=19551, 99.9=34719, 99.99=106431] 
2017-06-24 21:50:30:317 440 sec: 75494 operations; 292.8 current ops/sec; est completion in 16 hours 4 minutes [READ: Count=2928, Max=200703, Min=136, Avg=3409.92, 90=10383, 99=19439, 99.9=56255, 99.99=200703] 
2017-06-24 21:50:40:317 450 sec: 78424 operations; 293 current ops/sec; est completion in 15 hours 48 minutes [READ: Count=2930, Max=112063, Min=136, Avg=3410.47, 90=10623, 99=19423, 99.9=63263, 99.99=112063] 
2017-06-24 21:50:50:317 460 sec: 81521 operations; 309.7 current ops/sec; est completion in 15 hours 32 minutes [READ: Count=3097, Max=43487, Min=136, Avg=3227, 90=10207, 99=19407, 99.9=27231, 99.99=43487] 
2017-06-24 21:51:00:317 470 sec: 84855 operations; 333.4 current ops/sec; est completion in 15 hours 15 minutes [READ: Count=3334, Max=96767, Min=135, Avg=2990.58, 90=10119, 99=19247, 99.9=34495, 99.99=96767] 
2017-06-24 21:51:10:317 480 sec: 88102 operations; 324.7 current ops/sec; est completion in 15 hours [READ: Count=3247, Max=178943, Min=134, Avg=3082.85, 90=9951, 99=19215, 99.9=37087, 99.99=178943] 
2017-06-24 21:51:20:317 490 sec: 91516 operations; 341.4 current ops/sec; est completion in 14 hours 44 minutes [READ: Count=3414, Max=60895, Min=135, Avg=2927.36, 90=10007, 99=19487, 99.9=35551, 99.99=60895] 
2017-06-24 21:51:30:317 500 sec: 95190 operations; 367.4 current ops/sec; est completion in 14 hours 27 minutes [READ: Count=3674, Max=57695, Min=135, Avg=2717.23, 90=9895, 99=19295, 99.9=29439, 99.99=57695] 
2017-06-24 21:51:40:317 510 sec: 98748 operations; 355.8 current ops/sec; est completion in 14 hours 12 minutes [READ: Count=3558, Max=196735, Min=135, Avg=2809.7, 90=9831, 99=19263, 99.9=31071, 99.99=196735] 
2017-06-24 21:51:50:317 520 sec: 102761 operations; 401.3 current ops/sec; est completion in 13 hours 54 minutes [READ: Count=4013, Max=44063, Min=135, Avg=2487.16, 90=9311, 99=19071, 99.9=31631, 99.99=44063] 
2017-06-24 21:52:00:317 530 sec: 107015 operations; 425.4 current ops/sec; est completion in 13 hours 36 minutes [READ: Count=4254, Max=75519, Min=134, Avg=2348.33, 90=9215, 99=18703, 99.9=27471, 99.99=75519] 
2017-06-24 21:52:10:317 540 sec: 111622 operations; 460.7 current ops/sec; est completion in 13 hours 17 minutes [READ: Count=4607, Max=60607, Min=132, Avg=2167.31, 90=8927, 99=18447, 99.9=26351, 99.99=60607] 
2017-06-24 21:52:20:317 550 sec: 116551 operations; 492.9 current ops/sec; est completion in 12 hours 57 minutes [READ: Count=4929, Max=141823, Min=131, Avg=2024.88, 90=8335, 99=18703, 99.9=31599, 99.99=141823] 
2017-06-24 21:52:30:317 560 sec: 121581 operations; 503 current ops/sec; est completion in 12 hours 38 minutes [READ: Count=5030, Max=68607, Min=136, Avg=1987.25, 90=8431, 99=18735, 99.9=40927, 99.99=53759] 
2017-06-24 21:52:40:317 570 sec: 126897 operations; 531.6 current ops/sec; est completion in 12 hours 19 minutes [READ: Count=5316, Max=64479, Min=134, Avg=1878.57, 90=7975, 99=17791, 99.9=25983, 99.99=33247] 
2017-06-24 21:52:50:317 580 sec: 132591 operations; 569.4 current ops/sec; est completion in 11 hours 59 minutes [READ: Count=5694, Max=140671, Min=134, Avg=1753.19, 90=7591, 99=17631, 99.9=28319, 99.99=73983] 
2017-06-24 21:53:00:317 590 sec: 138961 operations; 637 current ops/sec; est completion in 11 hours 37 minutes [READ: Count=6370, Max=39743, Min=135, Avg=1568.82, 90=6883, 99=16223, 99.9=25887, 99.99=39615] 
2017-06-24 21:53:10:317 600 sec: 145805 operations; 684.4 current ops/sec; est completion in 11 hours 15 minutes [READ: Count=6844, Max=50111, Min=135, Avg=1458.56, 90=6143, 99=16591, 99.9=26287, 99.99=49215] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2017-06-24 21:53:10:326 600 sec: 145806 operations; 111.11 current ops/sec; est completion in 11 hours 15 minutes [READ: Count=1, Max=9127, Min=9120, Avg=9124, 90=9127, 99=9127, 99.9=9127, 99.99=9127] [CLEANUP: Count=1, Max=1538, Min=1538, Avg=1538, 90=1538, 99=1538, 99.9=1538, 99.99=1538] 
[OVERALL], RunTime(ms), 600011.0
[OVERALL], Throughput(ops/sec), 243.00554489834354
[TOTAL_GCS_PS_Scavenge], Count, 141.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 267.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.04449918418162334
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 141.0
[TOTAL_GC_TIME], Time(ms), 267.0
[TOTAL_GC_TIME_%], Time(%), 0.04449918418162334
[READ], Operations, 145806.0
[READ], AverageLatency(us), 4102.067061712138
[READ], MinLatency(us), 131.0
[READ], MaxLatency(us), 393727.0
[READ], 95thPercentileLatency(us), 12759.0
[READ], 99thPercentileLatency(us), 20015.0
[READ], Return=OK, 145806
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 1538.0
[CLEANUP], MinLatency(us), 1538.0
[CLEANUP], MaxLatency(us), 1538.0
[CLEANUP], 95thPercentileLatency(us), 1538.0
[CLEANUP], 99thPercentileLatency(us), 1538.0